package lesson04.code.primitive;

public class ArithmeticOperations {
    // это пример одинарной строки для комментария

    /*
    Блок строк для комментария

    Основные математические операции:
    сложение  : +
    вычитание : -
    умножение : *
    деление   : /
    остаток от деления : %

    остаток от деления:

    10 / 4 = 2,5

    Что будет являться результатом операции 10 % 4 ???

    Берем целую часть от деления: 2

    4 * 2 = 8

    остаток от деления = 10 - 8 = 2

    10 |  4
   -   |_______
     8    2
    ____
    2  --- это и есть результат операции остаток от деления

     */
}
